Autodesk.Revit.DB.ViewSchedule.Export(System.String,System.String,Autodesk.Revit.DB.ViewScheduleExportOptions)
Exports the schedule data to a text file.
folder:
Path to the location where the file will be saved.
name:
Name of file.
options:
Options that relate to schedule export.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GroupHeaders(System.Int32,System.Int32,System.Int32,System.Int32)
Groups schedule header cells.
top:
The index of the top row of the selected headers.
left:
The index of the left column of the selected headers.
bottom:
The index of the bottom row of the selected headers.
right:
The index of the right column of the selected headers.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Headers could not be grouped.
Since:
2014